logs/fio-diskseq/slurm/001/log008.txt
+ cd /nfs/workloads/slurm
+ mkdir -p tmp
+ cd tmp
+ fio --rw=write --name=kube-fio-write --output-format=normal,terse --bs=256k --size=8G
kube-fio-write: (g=0): rw=write, bs=(R) 256KiB-256KiB, (W) 256KiB-256KiB, (T) 256KiB-256KiB, ioengine=psync, iodepth=1
fio-3.35
Starting 1 process
3;fio-3.35;kube-fio-write;0;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;8388608;83908;327;99973;0;0;0.000000;0.000000;84;127993;2859.494188;6563.231183;1.000000%=95;5.000000%=96;10.000000%=97;20.000000%=99;30.000000%=105;40.000000%=112;50.000000%=116;60.000000%=146;70.000000%=177;80.000000%=6717;90.000000%=11337;95.000000%=14352;99.000000%=31588;99.500000%=36962;99.900000%=40632;99.950000%=43778;99.990000%=128450;0%=0;0%=0;0%=0;87;127998;2863.218190;6563.034957;2052;1941504;100.000000%;89455.336898;152244.898473;0.137038%;4.458248%;15434;1;13;100.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;21.15%;57.55%;0.05%;0.00%;0.00%;0.43%;0.24%;7.75%;10.98%;1.82%;0.00%;0.04%;0.00%;0.00%;0.00%;0.00%;0.00%;dm-0;687;4557;0;0;9488;140644;150132;58.23%;slaves;712;33767;0;51;11071;354130;367102;98.76%;sda;712;33767;0;51;11071;354130;367102;98.76%

kube-fio-write: (groupid=0, jobs=1): err= 0: pid=133469: Sat Nov 18 15:11:40 2023
  write: IOPS=327, BW=81.9MiB/s (85.9MB/s)(8192MiB/99973msec); 0 zone resets
    clat (usec): min=84, max=127993, avg=2859.49, stdev=6563.23
     lat (usec): min=87, max=127998, avg=2863.22, stdev=6563.03
    clat percentiles (usec):
     |  1.00th=[    96],  5.00th=[    97], 10.00th=[    98], 20.00th=[   100],
     | 30.00th=[   106], 40.00th=[   113], 50.00th=[   117], 60.00th=[   147],
     | 70.00th=[   178], 80.00th=[  6718], 90.00th=[ 11338], 95.00th=[ 14353],
     | 99.00th=[ 31589], 99.50th=[ 36963], 99.90th=[ 40633], 99.95th=[ 43779],
     | 99.99th=[128451]
   bw (  KiB/s): min= 2052, max=1941504, per=100.00%, avg=89455.34, stdev=152244.90, samples=187
   iops        : min=    8, max= 7584, avg=349.34, stdev=594.71, samples=187
  lat (usec)   : 100=21.15%, 250=57.55%, 500=0.05%
  lat (msec)   : 2=0.43%, 4=0.24%, 10=7.75%, 20=10.98%, 50=1.82%
  lat (msec)   : 250=0.04%
  cpu          : usr=0.14%, sys=4.46%, ctx=15434, majf=1, minf=13
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,32768,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=81.9MiB/s (85.9MB/s), 81.9MiB/s-81.9MiB/s (85.9MB/s-85.9MB/s), io=8192MiB (8590MB), run=99973-99973msec

Disk stats (read/write):
    dm-0: ios=687/4557, merge=0/0, ticks=9488/140644, in_queue=150132, util=58.23%, aggrios=712/33767, aggrmerge=0/51, aggrticks=11071/354130, aggrin_queue=367102, aggrutil=98.76%
  sda: ios=712/33767, merge=0/51, ticks=11071/354130, in_queue=367102, util=98.76%
+ fio --rw=read --name=kube-fio-read --output-format=normal,terse --bs=256k --size=8G
kube-fio-read: (g=0): rw=read, bs=(R) 256KiB-256KiB, (W) 256KiB-256KiB, (T) 256KiB-256KiB, ioengine=psync, iodepth=1
fio-3.35
Starting 1 process
3;fio-3.35;kube-fio-read;0;0;8388608;456846;1784;18362;0;0;0.000000;0.000000;24;148413;559.439006;2877.346111;1.000000%=26;5.000000%=28;10.000000%=31;20.000000%=36;30.000000%=37;40.000000%=38;50.000000%=39;60.000000%=41;70.000000%=44;80.000000%=50;90.000000%=62;95.000000%=1875;99.000000%=16056;99.500000%=16187;99.900000%=18219;99.950000%=20054;99.990000%=62128;0%=0;0%=0;0%=0;24;148413;559.509946;2877.343386;292864;491520;100.000000%;463701.333333;39643.860409;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;0.266870%;13.359839%;3355;0;211;100.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;79.26%;15.06%;0.05%;0.02%;0.02%;0.04%;1.12%;1.01%;1.15%;2.22%;0.03%;0.02%;0.01%;0.00%;0.00%;0.00%;0.00%;0.00%;dm-0;2024;38;0;0;60478;18584;79062;92.52%;slaves;33167;965;106;0;832482;20447;852955;99.46%;sda;33167;965;106;0;832482;20447;852955;99.46%

kube-fio-read: (groupid=0, jobs=1): err= 0: pid=133533: Sat Nov 18 15:11:59 2023
  read: IOPS=1784, BW=446MiB/s (468MB/s)(8192MiB/18362msec)
    clat (usec): min=24, max=148413, avg=559.44, stdev=2877.35
     lat (usec): min=24, max=148413, avg=559.51, stdev=2877.34
    clat percentiles (usec):
     |  1.00th=[   27],  5.00th=[   29], 10.00th=[   32], 20.00th=[   37],
     | 30.00th=[   38], 40.00th=[   39], 50.00th=[   40], 60.00th=[   42],
     | 70.00th=[   45], 80.00th=[   51], 90.00th=[   63], 95.00th=[ 1876],
     | 99.00th=[16057], 99.50th=[16188], 99.90th=[18220], 99.95th=[20055],
     | 99.99th=[62129]
   bw (  KiB/s): min=292864, max=491520, per=100.00%, avg=463701.33, stdev=39643.86, samples=36
   iops        : min= 1144, max= 1920, avg=1811.33, stdev=154.86, samples=36
  lat (usec)   : 50=79.26%, 100=15.06%, 250=0.05%, 500=0.02%, 750=0.02%
  lat (usec)   : 1000=0.04%
  lat (msec)   : 2=1.12%, 4=1.01%, 10=1.15%, 20=2.22%, 50=0.03%
  lat (msec)   : 100=0.02%, 250=0.01%
  cpu          : usr=0.27%, sys=13.36%, ctx=3355, majf=0, minf=211
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=32768,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=446MiB/s (468MB/s), 446MiB/s-446MiB/s (468MB/s-468MB/s), io=8192MiB (8590MB), run=18362-18362msec

Disk stats (read/write):
    dm-0: ios=2024/38, merge=0/0, ticks=60478/18584, in_queue=79062, util=92.52%, aggrios=33167/965, aggrmerge=106/0, aggrticks=832482/20447, aggrin_queue=852955, aggrutil=99.46%
  sda: ios=33167/965, merge=106/0, ticks=832482/20447, in_queue=852955, util=99.46%